`timescale 1ns/1ns
module motor_control_tb();
    // =========================
    // 1. Testbench信号
    // =========================
    reg clk;
    reg rst_n;
    reg [9:0] duty;
    reg dir;
    wire pwm_out;
    wire in1;
    wire in2;
    // =========================
    // 2. 实例化被测试模块
    // =========================
    motor_control #(
        .CLK_FREQ(50_000_000),
        .PWM_FREQ(20_000)
    ) uut (
        .clk     (clk),
        .rst_n   (rst_n),

        .duty    (duty),
        .dir     (dir),

        .pwm_out (pwm_out),
        .in1     (in1),
        .in2     (in2)
    );
    // =========================
    // 3. 产生50MHz时钟
    // =========================
    initial begin
        clk = 1'b0;
        forever #10 clk = ~clk;
    end
    // =========================
    // 4. 测试过程
    // =========================
    initial begin
        // 初始状态
        rst_n = 1'b0;
        duty  = 10'd0;
        dir   = 1'b0;
        // 保持复位一段时间
        #100;
        // 解除复位
        rst_n = 1'b1;
        // -------------------------
        // 测试1：停止
        // -------------------------
        duty = 10'd0;
        dir  = 1'b0;
        #100_000;
        // -------------------------
        // 测试2：正转，50%占空比
        // -------------------------
        duty = 10'd500;
        dir  = 1'b0;
        #100_000;
        // -------------------------
        // 测试3：正转，80%占空比
        // -------------------------
        duty = 10'd800;
        dir  = 1'b0;
        #100_000;
        // -------------------------
        // 测试4：反转，50%占空比
        // -------------------------
        duty = 10'd500;
        dir  = 1'b1;
        #100_000;
        // -------------------------
        // 测试5：反转，80%占空比
        // -------------------------
        duty = 10'd800;
        dir  = 1'b1;
        #100_000;
        // -------------------------
        // 测试6：重新停止
        // -------------------------
        duty = 10'd0;
        dir  = 1'b0;
        #100_000;
        $stop;
    end
endmodule